# Pandas

In [1]:
import pandas as pd
import numpy as np

## Series

#### Creating a Series

In [2]:
s = pd.Series([10,20,30,40])

In [3]:
s

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
dates = pd.date_range('20190531',periods=7)
dates

DatetimeIndex(['2019-05-31', '2019-06-01', '2019-06-02', '2019-06-03',
               '2019-06-04', '2019-06-05', '2019-06-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
s1 = pd.Series(dates)

In [8]:
s1

0   2019-05-31
1   2019-06-01
2   2019-06-02
3   2019-06-03
4   2019-06-04
5   2019-06-05
6   2019-06-06
dtype: datetime64[ns]

#### Accessing  a data

In [9]:
s[0]

10

In [9]:
s[1:]

1    20
2    30
3    40
dtype: int64

#### Changing the index values

In [10]:
s = pd.Series([10,20,30,40],['A','B','C','D'])
s

A    10
B    20
C    30
D    40
dtype: int64

In [11]:
data = {
    'Country' : ['Belgium','India','Brazil'],
    'Capital' : ['Brussels','Delhi','Brasilia'],
    'Population' : [11190846, 1303171035, 207847528]
}

In [12]:
# Directly passing the dictionary to a Series
s = pd.Series(data)
s

Country                [Belgium, India, Brazil]
Capital             [Brussels, Delhi, Brasilia]
Population    [11190846, 1303171035, 207847528]
dtype: object

In [13]:
s['Country']

['Belgium', 'India', 'Brazil']

## DataFrame

In [11]:
data = {
    'Country' : ['Belgium','India','Brazil'],
    'Capital' : ['Brussels','Delhi','Brasilia'],
    'Population' : [11190846, 1303171035, 207847528]
}

In [15]:
df = pd.DataFrame(data)
df.ndim
df

   Country   Capital  Population
0  Belgium  Brussels    11190846
1    India     Delhi  1303171035
2   Brazil  Brasilia   207847528

In [16]:
df = pd.DataFrame(data,index=(['A','B','C']))
df

   Country   Capital  Population
A  Belgium  Brussels    11190846
B    India     Delhi  1303171035
C   Brazil  Brasilia   207847528

### Slicing and indexing in DataFrame

#### Accessing using column

In [17]:
df

   Country   Capital  Population
A  Belgium  Brussels    11190846
B    India     Delhi  1303171035
C   Brazil  Brasilia   207847528

In [18]:
df['Country']

A    Belgium
B      India
C     Brazil
Name: Country, dtype: object

In [19]:
df[['Country','Capital']]

   Country   Capital
A  Belgium  Brussels
B    India     Delhi
C   Brazil  Brasilia

In [19]:
df[['Country','Population']]

   Country  Population
A  Belgium    11190846
B    India  1303171035
C   Brazil   207847528

In [20]:
df[0:]

   Country   Capital  Population
A  Belgium  Brussels    11190846
B    India     Delhi  1303171035
C   Brazil  Brasilia   207847528

#### To Access a row using loc/at and iloc/iat

In [21]:
df

   Country   Capital  Population
A  Belgium  Brussels    11190846
B    India     Delhi  1303171035
C   Brazil  Brasilia   207847528

In [25]:
#loc is used access a particular row name
df.loc['C']

Country          Brazil
Capital        Brasilia
Population    207847528
Name: C, dtype: object

In [26]:
#iloc is used to access a row using it's bydefult indexing i.e. numeric/position value
df.iloc[1]

Country            India
Capital            Delhi
Population    1303171035
Name: B, dtype: object

In [27]:
df.loc[['A'],['Capital']]

    Capital
A  Brussels

In [28]:
df.at['A','Capital']

'Brussels'

In [29]:
df.iloc[0,1]

'Brussels'

In [28]:
df.iat[0,1]

'Brussels'

In [29]:
# loc[row][column]
df.loc[['A','B'],['Country','Capital']]

   Country   Capital
A  Belgium  Brussels
B    India     Delhi

In [30]:
df.iloc[[0,1],[0,1]]

   Country   Capital
A  Belgium  Brussels
B    India     Delhi

# Sales Table

In [31]:
import pandas as pd
import numpy as np

In [32]:
df = pd.read_csv('Data/sales.csv')

In [33]:
df

  month  eggs  salt  spam  Unnamed: 4
0   Jan    47  12.0    17         NaN
1   Feb   110  50.0    31         NaN
2   Mar   221  89.0    72         NaN
3   Apr    77  87.0    20         NaN
4   May   132   NaN    52         NaN
5   Jun   205  60.0    55         NaN

In [34]:
# To remove column created by excel
data = pd.read_csv('Data/sales.csv',index_col='Unnamed: 4')
data

    month  eggs  salt  spam
NaN   Jan    47  12.0    17
NaN   Feb   110  50.0    31
NaN   Mar   221  89.0    72
NaN   Apr    77  87.0    20
NaN   May   132   NaN    52
NaN   Jun   205  60.0    55

## Accessing a particular value

### 1. Using row and column name

#### 1.1  Accesing a particular value by using column name and row name

In [6]:
# Put column nmae then row name
df = pd.DataFrame(data)
df['month']

NameError: name 'data' is not defined

In [ ]:
# Column then index
# data['01-Jan-2019']['Product_id'] #gives error

#### 1.2  Accesing a particular value by using dot value

In [ ]:
data.Product_id['01-Jan-2019']

### 2. Using loc and iloc

In [ ]:
data.loc['02-Jan-2019','Product_id']

In [ ]:
# First row then column is given
#data.loc['Product_id','02-Jan-2019']

In [ ]:
data.iloc[1,1]

## Getting some particular columns as new table

In [ ]:
new_data = data[['Units','Product_id']]

In [ ]:
new_data

In [ ]:
new_data['Product_id']

In [ ]:
data['Product_id']

## Accessing some part of table as slicing

In [ ]:
data

### 1. Using column and row

In [ ]:
#[column-slice][row-slice in numeric value only] why??
data['Product_id'][3:10]

In [ ]:
data['Product_id'][1:7]

### 2. using loc and iloc

In [ ]:
# .loc[row-slice,column-slice]
data.loc[:,'Product_id':'Channel']

In [ ]:
data.loc['04-Jan-2019':'10-Jan-2019',:]

In [ ]:
data.loc['04-Jan-2019':'10-Jan-2019','Region':'Units']

In [ ]:
data.iloc[3:10,:3]

In [ ]:
# Particular column list
data.loc['04-Jan-2019':'10-Jan-2019',['Region','Units']]

## Data Frame MultiIndex, Reshaping and Concatenation

### MultiIndexing

In [30]:
import pandas as pd
# Create dataframe with multiplex
df = pd.DataFrame({
    'a' : [4,5,6,7,8,9],
    'b' : [7,8,9,10,11,12],
    'c' : [10,11,12,13,11,9],
    'd' : [4,5,6,7,8,9],
    'e' : [7,8,9,10,11,12],
    'f' : [10,11,12,13,14,15]
},
    #create two column having value as tuple and names of column as n and v
index = pd.MultiIndex.from_tuples([('G1',1),('G1',1),('G2',2),('G2',2),('G3',3),('G3',3)],names=['n','v'])
)

In [31]:
df

      a   b   c  d   e   f
n  v
G1 1  4   7  10  4   7  10
   1  5   8  11  5   8  11
G2 2  6   9  12  6   9  12
   2  7  10  13  7  10  13
G3 3  8  11  11  8  11  14
   3  9  12   9  9  12  15

### Reshaping

In [ ]:
#all column into rows
pd.melt(df)

### Renaming and executing a query

In [ ]:
# Rename the default column name of melt()
df3 = pd.melt(df).rename(columns={'variable' : 'var', 'value' : 'val'}).query('val >10')
df3

### Spreading row of melt into columns. why??

In [ ]:
# spread rows into col
df3.pivot(columns='var', values='var')

### Concatanaion of two data frames

In [ ]:
df1 = pd.DataFrame(
    [[4,5,6],
    [7,8,9],
    [10,11,12]],
    index = [1,2,3],
    columns=['a','b','c']
)
df1

In [ ]:
df

In [ ]:
# We can't perform concat along axis 1
pd.concat([df1,df])

## Accessing

In [ ]:
df

In [ ]:
df['a']

In [ ]:
df[['a','f']]

In [ ]:
df.loc['G1']

In [ ]:
df.loc['G1','d']

In [ ]:
df.loc['G1','a':'c']

#### lin 30,68

# Filtering data from DataFrame

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
file = pd.read_csv('Data_set/sales.csv')

In [ ]:
file

In [ ]:
df = file = pd.read_csv('Data_set/sales.csv',index_col='month')

In [ ]:
df

In [ ]:
df['eggs']

In [ ]:
df['eggs'][2:4]

In [ ]:
df.salt

In [ ]:
df.salt>50

In [ ]:
df[df.salt>50]

In [ ]:
df[(df.salt>50) & (df.eggs<150)]

In [ ]:
df[(df.salt>50) | (df.eggs<150)]

## DataFrame with zeros and NaN

In [ ]:
df2 = df.copy()

In [ ]:
df2

In [ ]:
df2['new_col'] = [10,0,12,78,0,5]

In [ ]:
df2

In [ ]:
df2.all()

In [ ]:
df2.loc['feb','salt']

In [ ]:
df2.loc['feb','salt'] = 0

In [ ]:
df2

In [ ]:
df2.all()

In [ ]:
df2.loc[:,df2.all()]

In [ ]:
df2.loc[:,df2.any()]

In [ ]:
df.isnull().all()

In [ ]:
df.isnull().any()

In [ ]:
df.loc[:,df.isnull().any()]

In [ ]:
df.notnull().any()

In [ ]:
df.notnull().all()

In [ ]:
df.loc[:,df.notnull().all()]

In [ ]:
# Removes all rows having NaN Values
df.dropna(how='any')

In [ ]:
df

In [ ]:
df

In [ ]:
df.loc['feb','eggs']

In [ ]:
df.loc['feb','eggs'] = np.nan
df

In [ ]:
df.loc['feb','eggs'] = 110

In [ ]:
df

## Nesting of Condition

In [ ]:
df

In [ ]:
df.eggs

In [ ]:
df.eggs[df.eggs>100]

In [ ]:
df.eggs[df.salt>55]+=10

In [ ]:
df

In [ ]:
df.eggs[df.salt>55]-=10

In [ ]:
df

## Transformation of Data

In [ ]:
df

In [ ]:
#floor division in pandas
df.floordiv(10)

In [ ]:
import numpy as np

In [ ]:
#floor division in numpy
np.floor_divide(df,10)

### 1. Python functions Implementation

#### 1. defining a user function and implent it using apply or applymap

In [ ]:
def dozen(n):
   return n // 12

In [ ]:
df.apply(dozen)

In [ ]:
df.applymap(dozen)

#### 2. lambda function

In [ ]:
df.apply(lambda n: n//12)

### 2. Storing of transformation as a new column

In [ ]:
df['dozens_of_egg'] = df.eggs.floordiv(12)

In [ ]:
df

### 3. Manipulating index

In [ ]:
df.index

In [ ]:
df.index.str.upper()

In [ ]:
df.index = df.index.str.upper()

In [ ]:
df

In [ ]:
df.index.map(str.upper)

In [ ]:
df.index = df.index.map(str.lower)

In [ ]:
df

### 4. Adding two column and make a new one

In [ ]:
df['salt_eggs'] = df.salt + df.eggs

In [ ]:
df

In [ ]:
df

In [ ]:
df.dropna(how='any')

In [ ]:
df

In [ ]:
df.dropna()

In [ ]:
np.nan

In 120 and 124 contradict

134 how to assign a null value np.nan

Advantage of map like index.map, applymap

In [ ]:
df

In [ ]:
df.dropna(how='all')

## Different ways of creating MultiIndex

* Using tuples

* Using arrays

* Using product

* Using levels and labels

In [ ]:
import pandas as pd
# Create dataframe with multiplex
df = pd.DataFrame({
    'a' : [4,5,6,7],
    'b' : [7,8,9,11],
    'c' : [10,11,13,34]
},
    #create two column having value as tuple and names of column as n and v
index = pd.MultiIndex.from_tuples([('G1',1),('G1',1),('G2',2),('G2',2)],names=['n','v'])
)

In [ ]:
df

In [ ]:
import pandas as pd
# Create dataframe with multiplex
df = pd.DataFrame({
    'a' : [4,5,6,7],
    'b' : [7,8,9,11],
    'c' : [10,11,13,34]
},
    #create two column having value as tuple and names of column as n and v
index = pd.MultiIndex.from_arrays([['G1','G1','G2','G2'],[1,2,1,2]],names=['n','v'])
)

In [ ]:
df

In [ ]:
import pandas as pd
# Create dataframe with multiplex
df = pd.DataFrame({
    'a' : [4,5,6,7],
    'b' : [7,8,9,11],
    'c' : [10,11,13,34]
},
    #create two column having value as tuple and names of column as n and v
index = pd.MultiIndex.from_product([['G1','G2'],[1,2]],names=['n','v'])
)

In [ ]:
df

## Stacking and Unstacking

In [ ]:
import pandas as pd
# Create dataframe with multiplex
df = pd.DataFrame({
    'a' : [4,5,6,7],
    'b' : [7,8,9,11],
    'c' : [10,11,13,34]
},
    #create two column having value as tuple and names of column as n and v
index = pd.MultiIndex.from_product([['G1','G2'],[1,2]],names=['n','v'])
)

In [ ]:
df

In [ ]:
df.stack()

In [ ]:
df.unstack()

In [ ]:
df.unstack()

In [ ]:
import pandas as pd
# Create dataframe with multiplex
df = pd.DataFrame({
    'a' : [4,5,6,7],
    'b' : [7,8,9,11],
    'c' : [10,11,13,34]
},
    #create two column having value as tuple and names of column as n and v
index = pd.MultiIndex.from_arrays([['G1','G1','G2','G2'],[1,2,1,2]],names=['n','v'])
)

In [ ]:
df.unstack()

In [ ]:
import pandas as pd
# Create dataframe with multiplex
df = pd.DataFrame({
    'a' : [4,5,6,7],
    'b' : [7,8,9,11],
    'c' : [10,11,13,34]
},
    #create two column having value as tuple and names of column as n and v
index = pd.MultiIndex.from_tuples([('G1',1),('G1',1),('G2',2),('G2',2)],names=['n','v'])
)

In [ ]:
# When we created multi-index with tupples metod, then it's unstack() giving error
df.unstack()

In [ ]:
import pandas as pd
# Create dataframe with multiplex
df = pd.DataFrame({
    'a' : [4,5,6,7],
    'b' : [7,8,9,11],
    'c' : [10,11,13,34]
},
    #create two column having value as tuple and names of column as n and v
index = pd.MultiIndex.from_arrays([['G1','G1','G2','G2'],[1,2,1,2]],names=['n','v'])
)

In [ ]:
df.unstack()

In [ ]:
import pandas as pd
# Create dataframe with multiplex
df = pd.DataFrame({
    'a' : [4,5,6,7],
    'b' : [7,8,9,11],
    'c' : [10,11,13,34]
},
    #create two column having value as tuple and names of column as n and v
index = pd.MultiIndex.from_tuples([('G1',1),('G1',2),('G2',1),('G2',2)],names=['n','v'])
)

In [ ]:
df

In [ ]:
df.unstack()

In [ ]:
df

In [ ]:
df['a'][1]